{
  "title": "MacTime v.0.10 April Update",
  "date": "4.1.2024",
  "description": "All right, this MacTime update is pretty small and we didn't make a lot of new features or changes, as we're mainly focusing on revamping MacBlog (it was really bad compared to our other apps) and releasing new features to our core game site MacVG. So, let's see what changes we did to MacTime in this update:",
  "mainarticles": {
    "count": "2",
    "sh1": "NEW TAB: World Clock!",
    "p1": "This really isn't a new tab, technically, because all we did was moving the old MacTime homepage to a new page called World Clock, without anything new or any other changes. The reason why we did this? See the paragraph down below. With this change, the meaning of each of the MacTime page is more clear, and all the world clock related features and content are going to be on the World Clock tab in the future for your time zone needs! Now MacTime is more complete with different time functionalities 🌐!",
    "sh2": "NEW HOMEPAGE!",
    "p2": "The new MacTime homepage now features a sidebar on the right and a main pane on the left. You can now choose which widgets to pin to your MacTime homepage! This makes MacTime way more accessible, customizable, and fast, as you only need one page to see every MacTime apps! Simply select the widgets and they'll show up on the main panel, and you can do anything with the widgets on your time needs with MacTime 📌!"
  },
  "others": {
    "count": "3",
    "other1": "Minor appearance and functionality changes on each tab and page.",
    "other2": "The announcement banner now only shows up on the homepage.",
    "other3": "Fixed Sidebar and announcement banner not working on the countdown page."
  },
  "menulinks": {
    "count": "4",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Tab: World Clock",
    "menu2link": "#sh1",
    "menu3": "New Homepage",
    "menu3link": "#sh2",
    "menu4": "Others",
    "menu4link": "#otherslist"
  },
  "year": "2024"
}
