{
  "title": "MacTime v.0.6 February Update",
  "date": "2.3.2024",
  "description": "At the beginning of this month, our newly developed and released app, MacTime, is getting its version 0.6 update with a bunch of new features, changes, and more! Let's see what's new in this early but important update!",
  "mainarticles": {
    "count": "3",
    "sh1": "NEW TAB: Timer!",
    "p1": "This is definitely one of the most important, fundational, and useful features for MacTime. What is a time app when it doesn't have a count down timer? So we're introducing a count down timer that can count down from 5 seconds to more than 10 minutes! As this is more of a fundational feature update, we only developed the basic features, with a Start/End button, time display, and a progress bar that shows how much time has passed. This is a very simple but powerful tab. Don't worry, more advanced features and customizations are coming to MacTime Timer in future updates, so stay tuned ⌛!",
    "sh2": "NEW COLLAPSIBLE MENU",
    "p2": "Following the release of MacWeb Site Material 2, we introduced the sidebar on different MacWeb apps and other appearance changes, including the brand new collapsible menus. We're also adding a collapsible menu in MacTime: Help! Help is where you can get update information, app documentation, feedback, and more support directly from MacTime, so you won't have any trouble using any of our apps while also using MacTime in the most effective way 📃!",
    "sh3": "What's the Future of MacTime?",
    "p3": "For the first few updates since v.0.5 release, we'll continue pushing out basic and foundational features like Time, Stopwatch, Focus... , and after these basic features are all settled, we'll be rolling out more customizations, settings, and other options on these tabs for a more advanced user experience when using MacTime in later updates. So stay tuned, because you're gonna want to use the powerful MacTime app for your daily tasks 🔮! "
  },
  "others": {
    "count": "5",
    "other1": "Minor appearance and functionality changes on each tab and page.",
    "other2": "New appearance and content of the update announcement banner.",
    "other3": "Bug fixes on timer not counting properly and time not working.",
    "other4": "Bug fixes on time not displaying correctly and navigation changes.",
    "other5": "Minor user interface and user experience updates."
  },
  "menulinks": {
    "count": "5",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Tab: Timer",
    "menu2link": "#sh1",
    "menu3": "New Collapsible Menu",
    "menu3link": "#sh2",
    "menu4": "Future of MacTime",
    "menu4link": "#sh3",
    "menu5": "Others",
    "menu5link": "#otherslist"
  },
  "year": "2024"
}
