{
  "title": "MacTime v.0.5 Release",
  "date": "1.20.2024",
  "description": " Today, a brand new MacWeb app is made public: MacTime! Keep track of your time and your tasks with Time, Calendar, Timer, Stopwatch, Focus, and more features from MacTime! Check the time, add events in Calendar, add a count down, measure time, and focus on your work with this brand new handy app for you! ",
  "mainarticles": {
    "count": "5",
    "sh1": "NEW APP: MacTime!",
    "p1": " A new app is coming to MacWeb: MacTime! With this powerful new app, your work and daily lives both got easier! Keep track of important events, tasks, and dates with our customizable timing features! Know the time in different time zones, create and schedule events, create a count down, time an event, and focus on work, and so much more! We are very excited to announce the new MacTime's first verion 0.5 release, because this app will be so awesome for productivity ⚒️! ",
    "sh2": "NEW TAB: Time!",
    "p2": " Time is the homepage of MacTime. It shows the precise time of your time zone down to a second's accuracy! You can see the time clearly, see the date, and more time related information! More features like time zones, customization, weather, and other useful functionalities will also come to Time in future updates 🕒! ",
    "sh3": "NEW TAB: Stopwatch!",
    "p3": " You always need an app to time something, from how fast you can finish a task, time a race, or do other things, and Stopwatch helps you do that! Simply press the space bar or click the button to start timing, and click the pause button to end the timing, and press reset to use time again! More features and customization will also come in future updates ⏱️! ",
    "sh4": "NEW TABS COMING SOON",
    "p4": "Even more apps will come to MacTime soon! Calendar, where you can create events for each day and keep track of your work; Timer, where you can create a count down timer for an event; and Focus, where you can create a focus session for work! These awesome new features will come to MacTime in future updates, as this release is only version 0.5 📅!",
    "sh5": "NEW UPDATE SCHEDULE",
    "p5": "Just like all the other MacWeb apps, MacTime will also receive regular updates annually, with new features and changes releasing on the first day of each month! Stay tuned, because soon MacTime will become so feature packed that you cannot resist to use it for productivity 🔥! "
  },
  "others": {
    "count": "5",
    "other1": "Brand new appearance and functionalities on each tab and page.",
    "other2": "Added MacWeb's sidebar to easily navigate between all MacWeb apps.",
    "other3": "A refreshed look matching the release of MacWeb Site Material 2.",
    "other4": "Brand new visual affects.",
    "other5": "Brand new user interface and user experience."
  },
  "menulinks": {
    "count": "7",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New App Release",
    "menu2link": "#sh1",
    "menu3": "New Tab: Time",
    "menu3link": "#sh2",
    "menu4": "New Tab: Stopwatch",
    "menu4link": "#sh3",
    "menu5": "New Tabs Coming Soon",
    "menu5link": "#sh4",
    "menu6": "New Update Schedule",
    "menu6link": "#sh5",
    "menu7": "Others",
    "menu7link": "#otherslist"
  },
  "year": "2024"
}
