{
  "title": "MacTime v.1.0 July Update 🎉",
  "date": "7.1.2024",
  "description": "We have some exciting things to announce about MacTime today: with more than 6 months of development, updates, innovations, and fixing bugs, the first stable complete version of MacTime, version 1.0, is released! With this major milestone, MacTime is more mature, and everything we envisioned for MacTime v.1.0 is now fully functional, with no bugs present! You can finally enjoy the stable MacTime without \"coming soon\" features or any issues! Calendar is released in this update, along with new looks and patches on some bugs. Here's what's new with this update:",
  "mainarticles": {
    "count": "4",
    "sh1": "NEW TAB: Calendar!",
    "p1": "Calendar is the final tab completing MacTime, making this update the version 1.0 update. It has been a \"coming soon\" feature for more than half a year, and now it's finally here! This makes MacTime more powerful than ever because you can now manage your time more effectively and easily with Calendar. Want to keep track of your schedule and events? Just use MacTime Calendar! It records down any event and reminds you of it! Simply cilck on a day on the calendar to set an event! Click on the event again to remove it. You can also go to other months, and set events for them 📆!",
    "sh2": "NEW LOOKS!",
    "p2": "Following the release of MacWeb site material 3, we added responsive designs and features to all our apps, including MacTime, because a lot of people have been complaining about website not working when using a phone, a smaller screen, or when zooming in. With this improvement, MacTime automatically adjusts its content to fit the screen size perfectly without not being able to use some features, buttons, or links. This change made it easier for everyone to access the website and enjoy the same experience. We also updated some appearance and styling updates to fit MacWeb Site Material 3 🔥.",
    "sh3": "NEW UPDATE SCHEDULE!",
    "p3": "Just like the new update schedule we recently appiled to every other MacWeb app execpt for MacVG, MacTime is also getting an update every 2 months now, instead of the previous 1 month. We made this change because we believe that quality is more important than quantity, and every app should have \"quality\" development time before rushing out an update, so all the apps get \"quality\" features without bugs, while giving our developers a \"quality\" break time. This means that each update comes with more features and changes that are refined and tested, ensuring the \"quality\" of the app 🆕!",
    "sh4": "What about the future?",
    "p4": "This is the version 1.0 of MacTime, so that means you won't update it any more, right? Wrong! It's true that we won't release new tabs, but we'll push out more and more features and enhancements on the existing tabs! We'll make MacTime more complete and powerful with additional features, settings, upgrades, and customizations coming to each of the tab in the future. Stay tuned for these changes 🔮!"
  },
  "others": {
    "count": "3",
    "other1": "Fixed sidebar not working on the tabs.",
    "other2": "Minor appearance and functionality changes and fixes on some tabs.",
    "other3": "Updated homepage panel content because of the new Calendar tab and some bugs."
  },
  "menulinks": {
    "count": "6",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Tab: Calendar",
    "menu2link": "#sh1",
    "menu3": "New Looks",
    "menu3link": "#sh2",
    "menu4": "Update Schedule",
    "menu4link": "#sh3",
    "menu5": "MacTime's Future",
    "menu5link": "#sh4",
    "menu6": "Others",
    "menu6link": "#otherslist"
  },
  "year": "2024"
}
