{
  "title": "MacTime v.0.9 March Update",
  "date": "3.1.2024",
  "description": "At the beginning of this month, our newly developed and released app, MacTime, is getting its version 0.6 update with a bunch of new features, changes, and more! Let's see what's new in this early but important update!",
  "mainarticles": {
    "count": "4",
    "sh1": "NEW TAB: Alarm!",
    "p1": "What can better help you track your time than a powerful alarm? Introducing: MacTime Alarm! Now, you can choose a precise time to set an alarm, and as long as you keep the tab open, you'll get a reminder once the time's up! Simply click on the dropdowns and select \"Set Alarm\", and you can work without distraction and with Alarm to help you manage your time more efficiently without getting lost in time ⏰! ",
    "sh2": "NEW TAB: Countdown!",
    "p2": "Countdown is another powerful time tool developed by MacTime that shows you how much time is left until a future date! It can be as general as hundreds of years away, or as specific as seconds! Get the precise and accurate countdown for a date using the Countdown tab! You can use it to see how many days you have for an important event, or for the New Year countdown! Use Countdown however you like with more customizations coming in future updates 📅!",
    "sh3": "NEW TAB: Focus!",
    "p3": "Focus could be one of the most important time productivity tools in MacTime! Focus helps you focus for a session of time that you can customize, and every time the session ends, it lets you rest for 5 minutes until you can focus and work again! Focus uses the Pomodoro Technique to help you get the most out of your time while not being too stressed! Simply click the Start button and follow the prompts on the screen to use it ⏲️!",
    "sh4": "NEW APPEARANCE!",
    "p4": "Along with other MacWeb apps, MacTime is also getting its own color for a more unified, distinct, modern, and comfortable user experience! Originally we had dark blue for logo color, gold for accent color, and a lot of other random colors, but in this update, we changed all the colors to either green or neutral, so it's easier to navigate and use the app. Green also represents growth, which is what MacTime is for: to help you grow and improve with our powerful time management tools! The new colors also make the experience more vibrant and easier on the eyes 🎨."
  },
  "others": {
    "count": "5",
    "other1": "Minor appearance and functionality changes on each tab and page.",
    "other2": "Minor adjustments on each tab and page.",
    "other3": "Fixed Clock and timer bugs and Stopwatch not working properly.",
    "other4": "Updated timer progress bar for a more intuitive and modern look.",
    "other5": "Updated navigation bar and help menu."
  },
  "menulinks": {
    "count": "6",
    "menu1": "Intro",
    "menu1link": "#home",
    "menu2": "New Tab: Alarm",
    "menu2link": "#sh1",
    "menu3": "New Tab: Countdown",
    "menu3link": "#sh2",
    "menu4": "New Tab: Focus",
    "menu4link": "#sh3",
    "menu5": "New Appearance",
    "menu5link": "#sh4",
    "menu6": "Others",
    "menu6link": "#otherslist"
  },
  "year": "2024"
}
